cask_args appdir: '/Applications'

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "coreutils"
brew "dos2unix"
brew "findutils"
brew "gawk"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "gnu-sed"
brew "gnu-indent"
brew "gnu-getopt"
brew "gnutls"
brew "htop"
brew "mas"
brew "pstree"
brew "tree"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Desktop applications
cask "iterm2"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-prompt"

# Utils
cask "diffmerge"
cask "gpg-suite"
