cask_args appdir: '/Applications'

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "autoconf"
brew "automake"
brew "bat"
brew "brotli"
brew "c-ares"
brew "coreutils"
brew "dos2unix"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "gnu-sed"
brew "gnu-indent"
brew "gnu-getopt"
brew "gnutls"
brew "grpcui"
brew "htop"
brew "hub"
brew "jid"
brew "libpq"
brew "libsodium"
brew "lsd"
brew "m4"
brew "mas"
brew "nvm"
brew "openssl"
brew "pstree"
brew "readline"
brew "spaceship"
brew "sqlite3"
brew "sourcegraph/src-cli/src-cli"
brew "telnet"
brew "terminal-notifier"
brew "tldr"
brew "tree"
brew "unixodbc"
brew "watch"
brew "wget"
brew "wifi-password"
brew "xz"
brew "tcl-tk"
brew "yamllint"
brew "yq"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Desktop applications
# cask "aws-vpn-client"
# cask "docker"
cask "iterm2"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-prompt"

# Utils
cask "1password-cli"
cask "diffmerge"
cask "fig"
cask "gpg-suite"
